export type Mineral = {
  name: string;
  v_p: number;
  V_s: number;
  p: number;
  share: number;
  hardness: number;
};

const name_vs_vp: [name: string, vs: number, vp: number][] = [
  ["Кварц", 4.1, 6.08],
  ["Ортоклаз", 5.9, 3.08],
  ["Альбит", 6.06, 3.35],
  ["Анортит", 6.57, 3.55],
  ["Кальцит", 6.66, 3.59],
  ["Доломит", 3.5, 6.3],
  ["Биотит", 5.13, 2.98],
  ["Мусковит", 3.36, 5.81],
  ["Рог. обманка", 7.21, 4.0],
  ["Эпидот", 7.42, 4.25],
  ["Диопсид", 7.8, 4.39],
  ["Оливин", 8.2, 4.82],
  ["Альмандин", 5.25, 8.51],
  ["Корунд", 10.85, 6.37],
  ["Магнетит", 7.4, 4.2],
  ["Гематит", 5.7, 4.32],
  ["Галенит", 3.77, 2.08],
  ["Молибденит", 1.85, 3.9],
  ["Сфалерит", 2.56, 5.31],
  ["Пирит", 7.9, 5.06],
];

export const minerals: Mineral[] = name_vs_vp.map((tuple) => ({
  name: tuple[0],
  V_s: tuple[1] * 10 ** 3,
  v_p: tuple[2] * 10 ** 3,
  p: 10 ** 5,
  share: 1,
  hardness: 55 * 10 ** 6,
}));
